2D_Inviscid/Accelerating/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{

    inlet
    {
        type            waveTransmissive;
	field		p;
	psi		psi;
	gamma		1.4;
	value		uniform 1;
    }

    outlet
    {
        type            zeroGradient;
    }

   upperairfoil
    {
        type            zeroGradient;
    }

   lowerairfoil
    {
        type            zeroGradient;
    }

   front
    {
        type            empty;
    }

   back
    {
        type            empty;
    }
}

// ************************************************************************* //

